03_21_2022_19_17_59. Trial: 0. Epochs: 461. Hyperparameters: [[32, 64], 0]
Model: "custom_gru"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 gru (GRU)                   multiple                  4704      
                                                                 
 gru_1 (GRU)                 multiple                  6336      
                                                                 
 dense (Dense)               multiple                  33        
                                                                 
=================================================================
Total params: 11,073
Trainable params: 11,073
Non-trainable params: 0
_________________________________________________________________
