03_18_2022_21_31_12. Trial: 0. Epochs: 359. Hyperparameters: [[64, 128, 256, 512, 1024], 0]
Model: "custom_ffnn"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense (Dense)               multiple                  384       
                                                                 
 dense_1 (Dense)             multiple                  8320      
                                                                 
 dense_2 (Dense)             multiple                  33024     
                                                                 
 dense_3 (Dense)             multiple                  131584    
                                                                 
 dense_4 (Dense)             multiple                  525312    
                                                                 
 dense_5 (Dense)             multiple                  1025      
                                                                 
=================================================================
Total params: 699,649
Trainable params: 699,649
Non-trainable params: 0
_________________________________________________________________
Evaluation: [184530144.0, 13584.1875, 0.07399177551269531] 
Prediction: [[ 12155.753]
 [ 12705.245]
 [ 13315.811]
 ...
 [100128.87 ]
 [100128.87 ]
 [100128.87 ]] 
Cumulative Absolute Percentage Error on test data: 0.0739917622206703 



